; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-0 - location
	p1-2 - location
	p1-3 - location
	p2-3 - location
	p3-0 - location
	p3-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s3)
	(at package2 s2)
	(at package3 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s3 s2)
	(link s2 s3)
)
	(:goal (and
	(at driver1 s1)
	(at truck1 s0)
	(at truck2 s3)
	(at truck3 s1)
	(at truck4 s3)
	(at truck5 s2)
	(at package1 s3)
	(at package2 s3)
	(at package3 s0)
	))


)

; plan
1. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   goals met: 2 of 9
2. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   goals met: 2 of 9
3. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 2 of 9
4. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 2 of 9
5. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 2 of 9
6. (drive-truck truck5 s0 s2 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   goals met: 3 of 9
7. (disembark-truck driver1 truck5 s2)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 3 of 9
8. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 9
9. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 3 of 9
10. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 4 of 9
11. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 5 of 9
12. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 5 of 9
13. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 9
14. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 9
15. (drive-truck truck1 s3 s0 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 6 of 9
16. (drive-truck truck3 s3 s0 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 6 of 9
17. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 7 of 9
18. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 8 of 9
19. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 9 of 9
